app/controllers/organizations_controller.rb

  def index
    @organizations = Organization.all
---
SELECT * FROM `organizations`

  def show
    @organization = Organization.find(params[:id])
---
SELECT * FROM `organizations` WHERE (`organizations`.`id` = 9)

  def create
    @organization = Organization.new(params[:organization])

    respond_to do |format|@user
      if @organization.save
        flash[:notice] = 'Organization was successfully created.'

        @org_user = OrgUser.new(:organization_id => @organization.id, :user_id => params[:user_id])
        @org_user.save
---
INSERT INTO `organizations` (`created_at`, `updated_at`, `assign`, `org_name`) VALUES('2011-12-15 09:37:00', '2011-12-15 09:37:00', 0, 'jdhskjd')
INSERT INTO `org_users` (`created_at`, `updated_at`, `user_id`, `organization_id`) VALUES('2011-12-14 10:37:38', '2011-12-14 10:37:38', 4, 9)