app/controllers/projects_controller.rb

SELECT * FROM `organizations` WHERE (`organizations`.`id` = 10)
---
  def index
     organization = Organization.find(params[:organization_id])

SELECT * FROM `organizations` WHERE (`organizations`.`id` = 1)
---
  def new
    @project = Project.new
    @organization = Organization.find(params[:organization_id])

INSERT INTO `org_projects` (`created_at`, `project_id`, `updated_at`, `organization_id`) VALUES('2011-12-14 13:04:53', 10, '2011-12-14 13:04:53', 9)
INSERT INTO `projects` (`created_at`, `updated_at`, `project_name`, `desc`) VALUES('2011-12-14 12:58:18', '2011-12-14 12:58:18', '', '')
---
  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save

SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
DELETE FROM `projects` WHERE `id` = 1
---
  def destroy

    @project = Project.find(params[:id])
    @org_project = OrgProject.find_by_sql("select * from org_projects where project_id = '#{ params[:id] }' and organization_id = '#{ params[:organization_id]}'")
    @project.destroy