app/controllers/users_controller.rb

SELECT * FROM `organizations`
---
  def index
    if current_user.role == "su"
      @organizations = Organization.all

SELECT * FROM `users` WHERE (`users`.`id` = '3') LIMIT 1
---
  def destroy
    @user = User.find(params[:id])

SELECT * FROM `organizations` WHERE (`organizations`.`id` = 1)
---
  def project_user_in_org

    @projects = Project.find_by_sql("select * from projects where id in(select project_id from org_projects where organization_id = #{ params[:id] })")
    @users = User.find_by_sql("select * from users where id in(select user_id from org_users where organization_id = #{ params[:id] })")
    @organizations = Organization.find(params[:id])